const services = [
    {
      title: "Пакет Мінімальний",
      list: [
        "Первинна консультація з відповідями на запитання щодо проєкту та співпраці. ", 
        "Розбираємося у вашому продукті або послузі.", 
        "Аналіз ніші на картах.",
        "Реєстрація профілю.",
        "Верифікація / проходження перевірки.",
        "Розподіл рівнів доступу.",
        "Формування правильної назви.",
        "Підбір категорій бізнесу, що описують сферу діяльності компанії (до 10).",
        "Зазначення точної та повної адреси компанії з вірним розташуванням мітки на картах.",
        "Додавання території обслуговування.",
        "Налаштування годин роботи і зміненого графіка.",
        "Правильне налаштування номерів телефонів.",
        "Налаштування посилань з використанням UTM-міток.",
        "Налаштування бронювання.",
        "Додавання атрибутів і спеціальних можливостей.",
        "Додавання опису компанії.",
        "Зазначення дати відкриття.",
        "Публікація ваших фото/відео (до 10).",
        "Завантаження логотипу компанії та обкладинки профілю.",
        "Звітність про виконану роботу.",
    ]
    },
    {
      title: "Пакет Оптимальний",
      list: [
        "Первинна консультація з відповідями на запитання щодо проєкту та співпраці.", 
        "Розбираємося у вашому продукті або послузі.", 
        "Аналіз ніші на картах.", 
        "Реєстрація профілю.",
        "Верифікація / проходження перевірки.", 
        "Розподіл рівнів доступу.", 
        "Формування правильної назви.", 
        "Підбір категорій бізнесу, що описують сферу діяльності компанії (до 10).",
        "Зазначення точної та повної адреси компанії з вірним розташуванням мітки на картах.", 
        "Додавання території обслуговування.", 
        "Налаштування годин роботи і зміненого графіка.", 
        "Правильне налаштування номерів телефонів.",
        "Налаштування посилань з використанням UTM-міток.", 
        "Налаштування бронювання.", 
        "Розміщення до 10 послуг і товарів/меню (з коротким описом).", 
        "Додавання атрибутів і спеціальних можливостей.",
        "Додавання опису компанії.", 
        "Зазначення дати відкриття.", 
        "Публікація ваших фото/відео (до 10).", 
        "Завантаження логотипу компанії та обкладинки профілю.",
        "Звітність про виконану роботу.",
        "Складання опису компанії, що \"продає\" (до 750 знаків).",
        "Наповнення розділу \"Запитання та Відповіді\" (до 10 ваших запитань і відповідей).",
        "Створення 2-х публікацій \"Posts on Google\"."
    ]
    },
    {
        title: "Пакет Максимальний",
        list: [        
            "Первинна консультація з відповідями на запитання щодо проєкту та співпраці.",
            "Розбираємося у вашому продукті або послузі.",
            "Аналіз ніші на картах.",
            "Реєстрація профілю.",
            "Верифікація / проходження перевірки.",
            "Розподіл рівнів доступу.",
            "Формування правильної назви.",
            "Підбір категорій бізнесу, що описують сферу діяльності компанії (до 10).",
            "Зазначення точної та повної адреси компанії з вірним розташуванням мітки на картах.",
            "Додавання території обслуговування.",
            "Налаштування годин роботи і зміненого графіка.",
            "Правильне налаштування номерів телефонів.",
            "Налаштування посилань з використанням UTM-міток.",
            "Налаштування бронювання.",
            "Розміщення до 20 послуг і товарів/меню (з коротким описом).",
            "Додавання атрибутів і спеціальних можливостей.",
            "Додавання опису компанії.",
            "Зазначення дати відкриття.",
            "Публікація ваших фото/відео (до 20).",
            "Завантаження логотипу компанії та обкладинки профілю.",
            "Звітність про виконану роботу.",
            "Складання опису компанії, що \"продає\" (до 750 знаків).",
            "Наповнення розділу \"Запитання та Відповіді\" (до 10 ваших запитань і відповідей).",
            "Створення 2-х публікацій \"Posts on Google\".",
            "Створення QR коду для залучення нових відгуків",
      ]
      },
    {
        title: "Пакет Мінімальний",
        list: [        
            "Первинна консультація з відповідями на запитання щодо проєкту та співпраці.",
            "Розбираємося у вашому продукті або послузі.",
            "Аналіз ніші на картах.",
            "Отримання доступу до профілю.",
            "Аудит наявного профілю.",
            "Формування правильної назви.",
            "Підбір категорій бізнесу, що описують сферу діяльності компанії (до 10).",
            "Зазначення точної і повної адреси компанії з вірним розташуванням мітки на картах.ure",
            "Додавання території обслуговування.",
            "Налаштування годин роботи і зміненого графіка.",
            "Правильне налаштування номерів телефонів.",
            "Налаштування посилань з використанням UTM-міток.",
            "Налаштування бронювання.",
            "Активація функції обміну Повідомленнями.",
            "Розміщення до 10 послуг і товарів/меню (з коротким описом).",
            "Додавання атрибутів і спеціальних можливостей.",
            "Додавання опису компанії.",
            "Зазначення дати відкриття.",
            "Публікація ваших фото/відео (до 20).",
            "Завантаження логотипу компанії та обкладинки профілю.",
            "Звітність про виконану роботу.",
            "Створення QR коду для залучення відгуків.",
            
      ]
    },
    {
        title: "Пакет Оптимальний",
        list: [        
            "Первинна консультація з відповідями на запитання щодо проєкту та співпраці.",
            "Розбираємося у вашому продукті або послузі.",
            "Аналіз ніші на картах.ure",
            "Отримання доступу до профілю.",
            "Аудит наявного профілю.",
            "Формування правильної назви.",
            "Підбір категорій бізнесу, що описують сферу діяльності компанії (до 10).",
            "Зазначення точної і повної адреси компанії з вірним розташуванням мітки на картах.ature",
            "Додавання території обслуговування.",
            "Налаштування годин роботи і зміненого графіка.",
            "Правильне налаштування номерів телефонів.",
            "Налаштування посилань з використанням UTM-міток.",
            "Налаштування бронювання.",
            "Активація функції обміну Повідомленнями.",
            "Розміщення до 30 послуг і товарів/меню (з коротким описом).",
            "Додавання атрибутів і спеціальних можливостей.",
            "Додавання опису компанії.",
            "Зазначення дати відкриття.",
            "Публікація ваших фото/відео (до 20).",
            "Завантаження логотипу компанії та обкладинки профілю.",
            "Звітність про виконану роботу.",
            "Складання опису компанії, що \"продає\" (до 750 знаків).",
            "Наповнення розділу \"Запитання та Відповіді\" (до 10 ваших запитань і відповідей).",
            "Створення 2-х публікацій \"Posts on Google\".",
            "Створення QR коду для залучення відгуків.",
            
      ]
    },
    {
        title: "Пакет Максимальний",
        list: [        
            "Первинна консультація з відповідями на запитання щодо проєкту та співпраці.",
            "Розбираємося у вашому продукті або послузі.",
            "Аналіз ніші на картах.",
            "Отримання доступу до профілю.",
            "Аудит наявного профілю.",
            "Пошуковий аудит позицій наявного профілю за 3-10 ключовими запитами.",
            "Збір статистик наявного профілю.",
            "Створення звіту \"Точка А\" за всіма поточними показниками.",
            "Формування правильної назви.",
            "Підбір категорій бізнесу, що описують сферу діяльності компанії (до 10).",
            "Зазначення точної і повної адреси компанії з вірним розташуванням мітки на картах.",
            "Додавання території обслуговування.",
            "Налаштування годин роботи і зміненого графіка.",
            "Правильне налаштування номерів телефонів.",
            "Налаштування посилань з використанням UTM-міток.",
            "Налаштування бронювання.",
            "Активація функції обміну Повідомленнями.",
            "Розміщення до 60 послуг і товарів/меню (з коротким описом).",
            "Додавання атрибутів і спеціальних можливостей.",
            "Додавання опису компанії.",
            "Зазначення дати відкриття.",
            "Публікація ваших фото/відео (до 20).",
            "Завантаження логотипу компанії та обкладинки профілю.",
            "Звітність про виконану роботу.",
            "Складання опису компанії, що \"продає\" (до 750 знаків).",
            "Наповнення розділу \"Запитання та Відповіді\" (до 10 ваших запитань і відповідей).",
            "Створення 2-х публікацій \"Posts on Google\".",
            "Створення OR коду для залучення відгуків.",
            "Придушення негативних відгуків і відгуків з низькою оцінкою.",
            "Скарги на неприйнятні відгуки.",
            "Видалення неприпустимих фотографії та відео."
      ]
    },
    {
        title: "Пакет Максимальний",
        list: [        
            "Первинна консультація з відповідями на запитання щодо проєкту та співпраці.",
            "Розбираємося у вашому продукті або послузі.",
            "Аналіз ніші на картах.",
            "Отримання доступу до профілю.",
            "Аудит наявного профілю.",
            "Пошуковий аудит позицій наявного профілю за 3-10 ключовими запитами.",
            "Збір статистик наявного профілю.",
            "Створення звіту \"Точка А\" за всіма поточними показниками.",
            "Формування правильної назви.",
            "Підбір категорій бізнесу, що описують сферу діяльності компанії (до 10).",
            "Зазначення точної і повної адреси компанії з вірним розташуванням мітки на картах.",
            "Додавання території обслуговування.",
            "Налаштування годин роботи і зміненого графіка.",
            "Правильне налаштування номерів телефонів.",
            "Налаштування посилань з використанням UTM-міток.",
            "Налаштування бронювання.",
            "Активація функції обміну Повідомленнями.",
            "Розміщення до 60 послуг і товарів/меню (з коротким описом).",
            "Додавання атрибутів і спеціальних можливостей.",
            "Додавання опису компанії.",
            "Зазначення дати відкриття.",
            "Публікація ваших фото/відео (до 20).",
            "Завантаження логотипу компанії та обкладинки профілю.",
            "Звітність про виконану роботу.",
            "Складання опису компанії, що \"продає\" (до 750 знаків).",
            "Наповнення розділу \"Запитання та Відповіді\" (до 10 ваших запитань і відповідей).",
            "Створення 2-х публікацій \"Posts on Google\".",
            "Створення OR коду для залучення відгуків.",
            "Придушення негативних відгуків і відгуків з низькою оцінкою.",
            "Скарги на неприйнятні відгуки.",
            "Видалення неприпустимих фотографії та відео."
      ]
    },
    {
        title: "Пакет Мінімальний",
        additionalText: `Роботи на початковому етапі (розміщення
                        нового профілю або оптимізація наявного
                        профілю) - оплачуються додатково.`,
        list: [        
            "Щомісячні роботи (просування профілю):",
            "Щоденний контроль і захист інформації від чужих змін.",
            "Щоденна робота зі зворотним зв'язком від клієнтів (відповіді на відгуки, запитання, повідомлення).eature",
            "Публікація до 15 фото/відео щомісяця (публікуємо контент наданий вами).",
            "Створення 10 Публікацій щомісяця - інформуємо ваших клієнтів про нові пропозиції, надходження товару, акції, новини компанії та заходи.",
            "Наповнення профілю Товарами та Послугами.",
            "Щомісячний моніторинг позицій профілю та аналіз статистики.",
            "Оптимізація профілю.",
            "Вивчення відгуків клієнтів, рекомендації щодо поліпшення сервісу.",
            "Впровадження новинок.",
            "Впровадження протестованих методик.",
            "Контакт із техпідтримкою Google.",
            "Наочні звіти в особистому кабінеті зі щоденним оновленням.",
            "Докладні щомісячні звіти в графіках і цифрах, з коментарями та аналізом.",
            "Розширені квартальні звіти.",
            "Онлайн-підтримка персонального менеджера.",
           
      ]
    },
    {
        title: "Пакет Оптимальний",
        additionalText: `Роботи на початковому етапі (розміщення
        нового профілю або оптимізація наявного
        профілю) - оплачуються додатково.`,
        list: [        
            "Щомісячні роботи (просування профілю):",
            "Щоденний контроль і захист інформації від чужих змін.",
            "Щоденна робота зі зворотним зв'язком від клієнтів (відповіді на відгуки, запитання, повідомлення).",
            "Публікація до 15 фото/відео щомісяця (публікуємо контент наданий вами).",
            "Створення 10 Публікацій щомісяця - інформуємо ваших клієнтів про нові пропозиції, надходження товару, акції, новини компанії та заходи.",
            "Наповнення профілю Товарами та Послугами.",
            "Щомісячний моніторинг позицій профілю та аналіз статистики.",
            "Оптимізація профілю.",
            "Вивчення відгуків клієнтів, рекомендації щодо поліпшення сервісу.",
            "Впровадження новинок.",
            "Впровадження протестованих методик.",
            "Контакт із техпідтримкою Google.",
            "Наочні звіти в особистому кабінеті зі щоденним оновленням.",
            "Докладні щомісячні звіти в графіках і цифрах, з коментарями та аналізом.",
            "Розширені квартальні звіти.",
            "Онлайн-підтримка персонального менеджера.",
            "Додаткові переваги:",
            "SEO-копірайтинг.",
            "Боротьба з недобросовісною конкуренцією і спамом на картах у ніші.",
            "Наповнення розділу \"Запитання та Відповіді\".",
            "Поліпшення релевантності відгуків.",
            "Придушення негативних відгуків і відгуків з низькою оцінкою.",
            "Скарги на неприйнятні відгуки.",
            "Видалення неприпустимих фотографії та відео.",
            "Розширення списку запитів для просування.",
            "Аналіз конкурентів у Google Картах.",
            "Щотижневий моніторинг позицій за ключовими запитами.",
            "Формування black-листа компаній, які навмисне порушують правила Google (дублюючі профілі за однією адресою, фальшиві профілі за неіснуючими адресами тощо) та надсилання скарги для подальшого блокування їхніх профілів.",
            "Надання розширених звітів за будь-який період часу.",

      ]
    },
    {
        title: "Пакет Максимальний",
        additionalText: `Роботи на початковому етапі (розміщення
        нового профілю або оптимізація наявного
        профілю) - оплачуються додатково.`,
        list: [        
            "Щомісячні роботи (просування профілю):",
            "Щоденний контроль і захист інформації від чужих змін.",
            "Щоденна робота зі зворотним зв'язком від клієнтів (відповіді на відгуки, запитання, повідомлення).",
            "Публікація до 15 фото/відео щомісяця (публікуємо контент наданий вами).",
            "Створення 10 Публікацій щомісяця - інформуємо ваших клієнтів про нові пропозиції, надходження товару, акції, новини компанії та заходи.",
            "Наповнення профілю Товарами та Послугами.",
            "Щомісячний моніторинг позицій профілю та аналіз статистики.",
            "Оптимізація профілю.",
            "Вивчення відгуків клієнтів, рекомендації щодо поліпшення сервісу.",
            "Впровадження новинок.",
            "Впровадження протестованих методик.",
            "Контакт із техпідтримкою Google.",
            "Наочні звіти в особистому кабінеті зі щоденним оновленням.",
            "Докладні щомісячні звіти в графіках і цифрах, з коментарями та аналізом.",
            "Розширені квартальні звіти.",
            "Онлайн-підтримка персонального менеджера.",
            "Додаткові переваги:",
            "SEO-копірайтинг.",
            "Боротьба з недобросовісною конкуренцією і спамом на картах у ніші.",
            "Наповнення розділу \"Запитання та Відповіді\".",
            "Поліпшення релевантності відгуків.",
            "Придушення негативних відгуків і відгуків з низькою оцінкою.",
            "Скарги на неприйнятні відгуки.",
            "Видалення неприпустимих фотографії та відео.",
            "Розширення списку запитів для просування.",
            "Аналіз конкурентів у Google Картах.",
            "Щотижневий моніторинг позицій за ключовими запитами.",
            "Формування black-листа компаній, які навмисне порушують правила Google (дублюючі профілі за однією адресою, фальшиві профілі за неіснуючими адресами тощо) та надсилання скарги для подальшого блокування їхніх профілів.",
            "Надання розширених звітів за будь-який період часу.",
            "Захист від роботи з конкурентами",
      ]
    },

  ];
  
  function openServiceModal(serviceIndex) {
    const modal = document.getElementById('serviceModal');
    const titleElement = document.getElementById('modal-title');
    const listElement = document.getElementById('modal-list');
    const additionalText = document.getElementById('modal-additionalText');
  
    listElement.innerHTML = '';
  
    titleElement.textContent = services[serviceIndex].title;
  
    if(services[serviceIndex].additionalText){
        additionalText.textContent = services[serviceIndex].additionalText
    }

    services[serviceIndex].list.forEach(item => {
      const li = document.createElement('li');
      li.textContent = item;
      listElement.appendChild(li);
    });
  
    modal.style.display = 'block';
    document.body.style.overflow = 'hidden'; 
  }
  
  document.querySelectorAll('.service-button').forEach(button => {
    console.log(button)
    button.addEventListener('click', () => {
        
      const serviceIndex = button.getAttribute('data-index');
      openServiceModal(serviceIndex);
    });
  });
  
  // Close modal logic
  document.querySelector('.close').addEventListener('click', () => {
    document.getElementById('serviceModal').style.display = 'none';
    document.body.style.overflow = 'auto';
  });


  const serviceModal = document.getElementById('serviceModal');
  window.addEventListener('click', (event) => {
        if (event.target === serviceModal) {
            serviceModal.style.display = 'none';
            document.body.style.overflow = 'auto'; // Восстанавливаем прокрутку основной страницы
        }
    })